Lingjia007/STM32F407_Bootloader/IAP/menu.c
  menu_service_println(&g_menu_ctx, "Mounting LittleFS...");
  res = lfs_spi_flash_mount(&lfs);
  if (res != LFS_ERR_OK)
  {
    menu_service_println(&g_menu_ctx, "Error: LittleFS mount failed!");
    f_mount(NULL, (TCHAR const *)SDPath, 0);
    return;
  }

  menu_service_println(&g_menu_ctx, "Scanning TF card for bin, aes, hdiff and sig files...\r");
  scan_sd_card_files();

  if (file_count == 0)
  {
    menu_service_println(&g_menu_ctx, "No bin, aes, hdiff or sig files found on TF card!");
    lfs_spi_flash_unmount(&lfs);
    f_mount(NULL, (TCHAR const *)SDPath, 0);
    return;
  }

  menu_service_println(&g_menu_ctx, "Found files:");
  for (i = 0; i < file_count; i++)
  {
    snprintf(msg, sizeof(msg), "  [%d] %s", i + 1, file_list[i]);
    menu_service_println(&g_menu_ctx, msg);
  }

  menu_service_printf(&g_menu_ctx, "\r\nSelect file to store (1-%d) or 'a' to abort: ", file_count);
  menu_service_flush(&g_menu_ctx);

  while (1)
  {
    menu_service_getchar(&g_menu_ctx, &key, RX_TIMEOUT);
    if (key == 'a' || key == 'A')
    {
      menu_service_println(&g_menu_ctx, "\rAborted by user.");
      lfs_spi_flash_unmount(&lfs);
      f_mount(NULL, (TCHAR const *)SDPath, 0);
      return;
    }
    if (key >= '1' && key <= '9')
    {
      selected = key - '0';
      if (selected >= 1 && selected <= file_count)
        break;
    }
  }

  snprintf(msg, sizeof(msg), "\rSelected: %s", file_list[selected - 1]);
  menu_service_println(&g_menu_ctx, msg);
  menu_service_println(&g_menu_ctx, "Storing image to SPI Flash...");

  g_fatfs_transport.fs = &SDFatFS;
  g_lfs_transport.lfs = &lfs;
  strncpy(bootloader_ctx.config.storage.fatfs_path, file_list[selected - 1], sizeof(bootloader_ctx.config.storage.fatfs_path) - 1);
  bootloader_ctx.config.storage.fatfs_path[sizeof(bootloader_ctx.config.storage.fatfs_path) - 1] = '\0';
  strncpy(bootloader_ctx.config.storage.lfs_path, file_list[selected - 1], sizeof(bootloader_ctx.config.storage.lfs_path) - 1);
  bootloader_ctx.config.storage.lfs_path[sizeof(bootloader_ctx.config.storage.lfs_path) - 1] = '\0';

  err = bootloader_download(&g_fatfs_transport.base, &g_lfs_transport.base, bootloader_ctx.config.storage.lfs_path);

  if (err == BOOTLOADER_OK)
    menu_service_println(&g_menu_ctx, "Image stored successfully!");
  else
  {
    menu_service_print(&g_menu_ctx, "Store failed! Error code: ");
    menu_service_int2str((uint8_t *)msg, (uint32_t)(-err));
    menu_service_println(&g_menu_ctx, msg);
  }

  lfs_spi_flash_unmount(&lfs);
  f_mount(NULL, (TCHAR const *)SDPath, 0);
}

static void StoreFromInternalFlash(void)
{
  uint8_t key = 0;
  char filename[64];
  char msg[256];
  char size_str[16];
  uint8_t idx = 0;
  uint32_t size = 0;
  uint32_t flash_addr;
  uint32_t flash_size;
  int res;
  lfs_t lfs;
  lfs_file_t file;
  uint8_t buffer[256];
  uint32_t bytes_written = 0;
  uint32_t total_written = 0;

  menu_service_println(&g_menu_ctx, "Initializing SPI Flash...");
  res = lfs_spi_flash_init();
  if (res != 0)
  {
    menu_service_println(&g_menu_ctx, "Error: SPI Flash initialization failed!");
    return;
  }

  res = lfs_spi_flash_mount(&lfs);
  if (res != LFS_ERR_OK)
  {
    menu_service_println(&g_menu_ctx, "Error: LittleFS mount failed!");
    return;
  }

  menu_service_print(&g_menu_ctx, "\r\nEnter filename (with .bin, .bin.aes, .hdiff or .sig extension): ");
  idx = 0;
  menu_service_flush(&g_menu_ctx);

  while (1)
  {
    menu_service_getchar(&g_menu_ctx, &key, RX_TIMEOUT);
    if (key == '\r' || key == '\n')
    {
      filename[idx] = '\0';
      break;
    }
    else if (key == 0x08 || key == 0x7F)
    {
      if (idx > 0)
      {
        idx--;
        menu_service_print(&g_menu_ctx, "\b \b");
      }
    }
    else if (idx < sizeof(filename) - 1 && key >= 0x20 && key <= 0x7E)
    {
      filename[idx++] = key;
      char echo_ch[2] = {(char)key, '\0'};
      menu_service_print(&g_menu_ctx, echo_ch);
    }
  }

  if (idx == 0)
  {
    menu_service_println(&g_menu_ctx, "\rError: Empty filename!");
    lfs_spi_flash_unmount(&lfs);
    return;
  }

  if (!check_file_extension(filename))
  {
    menu_service_println(&g_menu_ctx, "\rError: Invalid file extension! Must be .bin, .bin.aes, .hdiff or .sig");
    lfs_spi_flash_unmount(&lfs);
    return;
  }

  menu_service_print(&g_menu_ctx, "\r\nEnter size in bytes (or 'm' for max): ");
  idx = 0;
  menu_service_flush(&g_menu_ctx);

  while (1)
  {
    menu_service_getchar(&g_menu_ctx, &key, RX_TIMEOUT);
    if (key == '\r' || key == '\n')
    {
      size_str[idx] = '\0';
      break;
    }
    else if (idx < sizeof(size_str) - 1)
    {
      if ((key >= '0' && key <= '9') || (idx == 0 && (key == 'm' || key == 'M')))
      {
        size_str[idx++] = key;
        char echo_ch[2] = {(char)key, '\0'};
        menu_service_print(&g_menu_ctx, echo_ch);
      }
    }
  }

  if (idx == 0)
  {
    menu_service_println(&g_menu_ctx, "\rError: Empty size!");
    lfs_spi_flash_unmount(&lfs);
    return;
  }

  if (size_str[0] == 'm' || size_str[0] == 'M')
  {
    size = USER_FLASH_SIZE;
  }
  else
  {
    size = 0;
    for (idx = 0; size_str[idx] != '\0'; idx++)
    {
      if (size_str[idx] >= '0' && size_str[idx] <= '9')
        size = size * 10 + (size_str[idx] - '0');
    }
  }

  if (size == 0 || size > USER_FLASH_SIZE)
  {
    menu_service_println(&g_menu_ctx, "\rError: Invalid size!");
    lfs_spi_flash_unmount(&lfs);
    return;
  }

  snprintf(msg, sizeof(msg), "\rFilename: %s, Size: %u bytes", filename, (unsigned int)size);
  menu_service_println(&g_menu_ctx, msg);
  menu_service_print(&g_menu_ctx, "Confirm? (y/n): ");
  menu_service_flush(&g_menu_ctx);
  menu_service_getchar(&g_menu_ctx, &key, RX_TIMEOUT);

  if (key != 'y' && key != 'Y')
  {
    menu_service_println(&g_menu_ctx, "\rAborted by user.");
    lfs_spi_flash_unmount(&lfs);
    return;
  }

  menu_service_println(&g_menu_ctx, "\rStoring from Internal Flash to SPI Flash...");

  res = lfs_file_open(&lfs, &file, filename, LFS_O_WRONLY | LFS_O_CREAT | LFS_O_TRUNC);
  if (res != LFS_ERR_OK)
  {
    menu_service_println(&g_menu_ctx, "Error: Cannot create file!");
    lfs_spi_flash_unmount(&lfs);
    return;
  }

  flash_addr = APPLICATION_ADDRESS;
  flash_size = size;

