Lingjia007/STM32F407_Bootloader/IAP/menu.c
  while (total_written < flash_size)
  {
    uint32_t to_write = sizeof(buffer);
    if (flash_size - total_written < to_write)
      to_write = flash_size - total_written;

    memcpy(buffer, (uint8_t *)(flash_addr + total_written), to_write);
    bytes_written = lfs_file_write(&lfs, &file, buffer, to_write);
    if (bytes_written != to_write)
    {
      menu_service_println(&g_menu_ctx, "Error: Write failed!");
      lfs_file_close(&lfs, &file);
      lfs_spi_flash_unmount(&lfs);
      return;
    }

    total_written += to_write;
    if ((total_written % 4096) == 0 || total_written == flash_size)
    {
      snprintf(msg, sizeof(msg), "Progress: %u / %u bytes\r", (unsigned int)total_written, (unsigned int)flash_size);
      menu_service_print(&g_menu_ctx, msg);
    }
  }

  lfs_file_close(&lfs, &file);
  lfs_spi_flash_unmount(&lfs);
  menu_service_println(&g_menu_ctx, "\rImage stored successfully!");
}

static void cmd_store_from_tf(menu_ctx_t *ctx, int argc, char *argv[])
{
  StoreFromTFCard();
}

static void cmd_store_from_flash(menu_ctx_t *ctx, int argc, char *argv[])
{
  StoreFromInternalFlash();
}

static void cmd_show_stored(menu_ctx_t *ctx, int argc, char *argv[])
{
  lfs_t lfs;
  int res;

  res = lfs_spi_flash_init();
  if (res != 0)
  {
    menu_service_println(ctx, "Error: SPI Flash init failed!");
    return;
  }

  res = lfs_spi_flash_mount(&lfs);
  if (res != LFS_ERR_OK)
  {
    menu_service_println(ctx, "Error: Cannot mount SPI Flash!");
    return;
  }

  ShowStoredImages(&lfs);
  lfs_spi_flash_unmount(&lfs);
}

static void cmd_delete_stored(menu_ctx_t *ctx, int argc, char *argv[])
{
  lfs_t lfs;
  int res;

  res = lfs_spi_flash_init();
  if (res != 0)
  {
    menu_service_println(ctx, "Error: SPI Flash init failed!");
    return;
  }

  res = lfs_spi_flash_mount(&lfs);
  if (res != LFS_ERR_OK)
  {
    menu_service_println(ctx, "Error: Cannot mount SPI Flash!");
    return;
  }

  DeleteStoredImage(&lfs);
  lfs_spi_flash_unmount(&lfs);
}

static void cmd_delete_fs(menu_ctx_t *ctx, int argc, char *argv[])
{
  lfs_t lfs;
  int res;

  res = lfs_spi_flash_init();
  if (res != 0)
  {
    menu_service_println(ctx, "Error: SPI Flash init failed!");
    return;
  }

  res = lfs_spi_flash_mount(&lfs);
  if (res != LFS_ERR_OK)
  {
    menu_service_println(ctx, "Error: Cannot mount SPI Flash!");
    return;
  }

  DeleteEntireFS(&lfs);
  lfs_spi_flash_unmount(&lfs);
}
#endif

#if MENU_ENABLE_ESP8266_WIFI
static void Print_Current_Time(void)
{
  platform_rtc_time_t rtc_time;
  platform_rtc_date_t rtc_date;
  char msg[128];

  if (RTC_GET_TIME(&g_rtc.base, &rtc_time) != RTC_STATUS_OK)
  {
    menu_service_println(&g_menu_ctx, "Failed to get RTC time!");
    return;
  }

  if (RTC_GET_DATE(&g_rtc.base, &rtc_date) != RTC_STATUS_OK)
  {
    menu_service_println(&g_menu_ctx, "Failed to get RTC date!");
    return;
  }

  if (rtc_date.year < 2025)
  {
    menu_service_println(&g_menu_ctx, "RTC time not set (year < 2025)");
    return;
  }

  snprintf(msg, sizeof(msg), "\rCurrent Time: %04d-%02d-%02d %02d:%02d:%02d (UTC+8)",
           rtc_date.year, rtc_date.month, rtc_date.date,
           rtc_time.hours, rtc_time.minutes, rtc_time.seconds);
  menu_service_println(&g_menu_ctx, msg);

  uint32_t timestamp;
  if (RTC_GET_TIMESTAMP(&g_rtc.base, &timestamp) == RTC_STATUS_OK)
  {
    snprintf(msg, sizeof(msg), "Unix Timestamp: %lu", (unsigned long)timestamp);
    menu_service_println(&g_menu_ctx, msg);
  }
}

static void cmd_esp8266_init(menu_ctx_t *ctx, int argc, char *argv[])
{
  char msg[128];

  menu_service_println(ctx, "Initializing ESP8266...");

  menu_service_println(ctx, "Step 1: AT test...");
  if (WIFI_AT_TEST(&g_esp8266_wifi.base) == PLATFORM_WIFI_OK)
    menu_service_println(ctx, "  AT test OK!");
  else
  {
    menu_service_println(ctx, "  AT test FAILED!");
    return;
  }

  char ip_buf[48] = {0};
  if (WIFI_GET_IP(&g_esp8266_wifi.base, ip_buf, sizeof(ip_buf)) == PLATFORM_WIFI_OK && ip_buf[0] != '\0')
  {
    snprintf(msg, sizeof(msg), "  Already connected! IP: %s", ip_buf);
    menu_service_println(ctx, msg);
    menu_service_println(ctx, "Step 2: Init OTA context...");
    esp8266_ota_init();
    menu_service_println(ctx, "ESP8266 init done!");
    return;
  }

  menu_service_println(ctx, "Step 2: Set STA mode...");
  if (WIFI_SET_MODE(&g_esp8266_wifi.base, PLATFORM_WIFI_MODE_STA) == PLATFORM_WIFI_OK)
    menu_service_println(ctx, "  STA mode OK!");
  else
  {
    menu_service_println(ctx, "  Set STA mode FAILED!");
    return;
  }

  snprintf(msg, sizeof(msg), "Step 3: Join AP %s...", ESP8266_WIFI_SSID);
  menu_service_println(ctx, msg);
  if (WIFI_JOIN_AP(&g_esp8266_wifi.base, ESP8266_WIFI_SSID, ESP8266_WIFI_PASSWORD) == PLATFORM_WIFI_OK)
  {
    menu_service_println(ctx, "  Join AP OK!");
    if (WIFI_GET_IP(&g_esp8266_wifi.base, ip_buf, sizeof(ip_buf)) == PLATFORM_WIFI_OK)
    {
      snprintf(msg, sizeof(msg), "  IP: %s", ip_buf);
      menu_service_println(ctx, msg);
    }
  }
  else
  {
    menu_service_println(ctx, "  Join AP FAILED!");
    return;
  }

  menu_service_println(ctx, "Step 4: Init OTA context...");
  esp8266_ota_init();
  menu_service_println(ctx, "ESP8266 init done!");
}

static void cmd_esp8266_at_test(menu_ctx_t *ctx, int argc, char *argv[])
{
  menu_service_println(ctx, "Testing AT command...");
  if (WIFI_AT_TEST(&g_esp8266_wifi.base) == PLATFORM_WIFI_OK)
    menu_service_println(ctx, "AT test OK!");
  else
    menu_service_println(ctx, "AT test FAILED!");
}

static void cmd_esp8266_tcp_connect(menu_ctx_t *ctx, int argc, char *argv[])
{
  char server_ip[64];
  char server_port[8];
  char msg[128];
  uint8_t key = 0;
  uint8_t idx = 0;

  menu_service_print(ctx, "\r\nEnter server IP: ");
  idx = 0;
  menu_service_flush(ctx);
  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == '\r' || key == '\n')
    {
      server_ip[idx] = '\0';
      break;
    }
    else if (key == 0x08 || key == 0x7F)
    {
      if (idx > 0)
      {
        idx--;
        menu_service_print(ctx, "\b \b");
      }
    }
    else if (idx < sizeof(server_ip) - 1 && key >= 0x20 && key <= 0x7E)
    {
      server_ip[idx++] = key;
      char echo_ch[2] = {(char)key, '\0'};
      menu_service_print(ctx, echo_ch);
    }
  }

  menu_service_print(ctx, "\r\nEnter server port: ");
  idx = 0;
  menu_service_flush(ctx);
  while (1)
  {
    menu_service_getchar(ctx, &key, RX_TIMEOUT);
    if (key == '\r' || key == '\n')
    {
      server_port[idx] = '\0';
      break;
    }
    else if (key == 0x08 || key == 0x7F)
    {
      if (idx > 0)
      {
        idx--;
        menu_service_print(ctx, "\b \b");
      }
    }
    else if (idx < sizeof(server_port) - 1 && key >= '0' && key <= '9')
    {
      server_port[idx++] = key;
      char echo_ch[2] = {(char)key, '\0'};
      menu_service_print(ctx, echo_ch);
    }
  }

