Lingjia007/STM32F407_Bootloader/IAP/menu.c
  if (verify_result == ED25519_VERIFY_OK)
  {
    menu_service_println(ctx, "Ed25519 signature verification PASSED!");
    menu_service_println(ctx, "Firmware integrity confirmed.");
  }
  else
  {
    menu_service_print(ctx, "Ed25519 signature verification FAILED! ");
    menu_service_println(ctx, ed25519_verify_err_to_string(verify_result));
  }
}

static void cmd_ed25519_verify_sdcard(menu_ctx_t *ctx, int argc, char *argv[])
{
  FRESULT res;
  char msg[256];
  ed25519_storage_ctx_t storage = {"SD card", "0:/", "0:/", NULL};

  menu_service_println(ctx, "Initializing TF card...");
  res = f_mount(&SDFatFS, (TCHAR const *)SDPath, 1);
  if (res != FR_OK)
  {
    menu_service_print(ctx, "Error: SD card mount failed! Error code: ");
    menu_service_int2str((uint8_t *)msg, res);
    menu_service_println(ctx, msg);
    return;
  }

  platform_fs_fatfs_register(&g_fs_fatfs, &SDFatFS, "fatfs");
  storage.fs = &g_fs_fatfs.base;

  cmd_ed25519_verify_workflow(ctx, &storage);

  f_mount(NULL, (TCHAR const *)SDPath, 0);
}

static void cmd_ed25519_verify_spi(menu_ctx_t *ctx, int argc, char *argv[])
{
  int res;
  lfs_t lfs;
  ed25519_storage_ctx_t storage = {"SPI Flash", "/", "", NULL};

  menu_service_println(ctx, "Initializing SPI Flash...");
  res = lfs_spi_flash_init();
  if (res != 0)
  {
    menu_service_println(ctx, "Error: SPI Flash initialization failed!");
    return;
  }

  menu_service_println(ctx, "Mounting LittleFS...");
  res = lfs_spi_flash_mount(&lfs);
  if (res != LFS_ERR_OK)
  {
    menu_service_println(ctx, "Error: LittleFS mount failed!");
    return;
  }

  platform_fs_lfs_register(&g_fs_lfs, &lfs, "lfs");
  storage.fs = &g_fs_lfs.base;

  cmd_ed25519_verify_workflow(ctx, &storage);

  lfs_spi_flash_unmount(&lfs);
}

static void cmd_ed25519_verify_buffer_test(menu_ctx_t *ctx, int argc, char *argv[])
{
  uint8_t test_message[] = "Hello, Ed25519!";
  uint8_t test_public_key[EDSIGN_PUBLIC_KEY_SIZE] = {0};
  uint8_t test_secret_key[EDSIGN_SECRET_KEY_SIZE] = {0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08,
                                                     0x09, 0x0a, 0x0b, 0x0c, 0x0d, 0x0e, 0x0f, 0x10,
                                                     0x11, 0x12, 0x13, 0x14, 0x15, 0x16, 0x17, 0x18,
                                                     0x19, 0x1a, 0x1b, 0x1c, 0x1d, 0x1e, 0x1f, 0x20};
  uint8_t test_signature[EDSIGN_SIGNATURE_SIZE];
  int verify_result;
  char msg[128];

  menu_service_println(ctx, "Running Ed25519 buffer verify test...");

  edsign_sec_to_pub(test_public_key, test_secret_key);
  edsign_sign(test_signature, test_public_key, test_secret_key,
              test_message, sizeof(test_message) - 1);

  menu_service_println(ctx, "Test message: \"Hello, Ed25519!\"");
  snprintf(msg, sizeof(msg), "Public key: %02X%02X%02X%02X...",
           test_public_key[0], test_public_key[1],
           test_public_key[2], test_public_key[3]);
  menu_service_println(ctx, msg);
  snprintf(msg, sizeof(msg), "Signature: %02X%02X%02X%02X...%02X%02X%02X%02X",
           test_signature[0], test_signature[1],
           test_signature[2], test_signature[3],
           test_signature[60], test_signature[61],
           test_signature[62], test_signature[63]);
  menu_service_println(ctx, msg);

  verify_result = ed25519_verify_buffer(test_message, sizeof(test_message) - 1,
                                        test_signature, test_public_key);

  if (verify_result == ED25519_VERIFY_OK)
    menu_service_println(ctx, "Buffer verify test PASSED!");
  else
  {
    menu_service_print(ctx, "Buffer verify test FAILED! ");
    menu_service_println(ctx, ed25519_verify_err_to_string(verify_result));
  }

  test_signature[0] ^= 0xFF;
  verify_result = ed25519_verify_buffer(test_message, sizeof(test_message) - 1,
                                        test_signature, test_public_key);

  if (verify_result == ED25519_VERIFY_ERR_FAILED)
    menu_service_println(ctx, "Tampered signature test PASSED (correctly rejected)!");
  else
    menu_service_println(ctx, "Tampered signature test FAILED (should have been rejected)!");
}
#endif

#if MENU_ENABLE_ESP8266_WIFI
MENU_TABLE(mqtt_menu) = {
    MENU_ITEM_CMD("1", "Check MQTT Connection Status", "Query current MQTT connection", cmd_mqtt_check_status),
    MENU_ITEM_CMD("2", "Configure MQTT User", "Set client ID, username, password", cmd_mqtt_configure),
    MENU_ITEM_CMD("3", "Connect to MQTT Server", "Connect to OneNET MQTT broker", cmd_mqtt_connect),
    MENU_ITEM_CMD("4", "Subscribe Property Topics", "Subscribe to all property topics", cmd_mqtt_subscribe),
    MENU_ITEM_CMD("5", "Publish Property", "Publish a single property value", cmd_mqtt_publish),
    MENU_ITEM_CMD("6", "Listen & Auto Reply Property Set", "Listen for property set commands", cmd_mqtt_listen),
    MENU_ITEM_CMD("7", "Disconnect MQTT", "Disconnect from MQTT broker", cmd_mqtt_disconnect),
    MENU_ITEM_CMD("8", "Sync Time (SNTP)", "Synchronize RTC from NTP server", cmd_mqtt_sync_time),
    MENU_ITEM_CMD("9", "Publish RTC Time (1s interval)", "Publish RTC time periodically", cmd_mqtt_publish_rtc),
    MENU_ITEM_BACK(),
    MENU_TABLE_END};

MENU_TABLE(esp8266_menu) = {
    MENU_ITEM_CMD("1", "WiFi Init & Connect AP", "Initialize ESP8266 and connect", cmd_esp8266_init),
    MENU_ITEM_CMD("2", "AT Command Test", "Test ESP8266 AT communication", cmd_esp8266_at_test),
    MENU_ITEM_CMD("3", "TCP Connect Test", "Connect to TCP server", cmd_esp8266_tcp_connect),
    MENU_ITEM_CMD("4", "Enter Transparent Mode", "Enable transparent transmission", cmd_esp8266_transparent_enter),
    MENU_ITEM_CMD("5", "Exit Transparent Mode", "Disable transparent transmission", cmd_esp8266_transparent_exit),
    MENU_ITEM_CMD("6", "Set OTA Target: Internal Flash", "OTA downloads to internal flash", cmd_ota_target_internal),
    MENU_ITEM_CMD("7", "Set OTA Target: SD Card (FATFS)", "OTA downloads to SD card", cmd_ota_target_sdcard),
    MENU_ITEM_CMD("8", "Set OTA Target: SPI Flash (LFS)", "OTA downloads to SPI flash", cmd_ota_target_spi),
    MENU_ITEM_CMD("9", "OneNET OTA Download", "Start OTA download from OneNET", cmd_onenet_ota_download),
    MENU_ITEM_CMD("A", "Show Current Time", "Display RTC time and timestamp", cmd_show_time),
    MENU_ITEM_SUBMENU("B", "MQTT Test Menu", "MQTT protocol testing", mqtt_menu, sizeof(mqtt_menu) / sizeof(mqtt_menu[0]) - 1),
    MENU_ITEM_BACK(),
    MENU_TABLE_END};
#endif

